"""
6. Пользователь вводит номер буквы в алфавите. Определить, какая это буква.
"""


def alphabet():
    while True:
        num = input('Введите номер буквы латинского алфавита ')
        if num.isdigit():
            if len(num) > 2 or int(num) not in range(1, 27):
                print('Заданный номер не в диапазоне латинского алфавита')
            else:
                break
        else:
            print('Некорректный ввод')
    my_alphabet = {1: 'a', 2: 'b', 3: 'c', 4: 'd', 5: 'e',
                   6: 'f', 7: 'g', 8: 'h', 9: 'i', 10: 'j',
                   11: 'k', 12: 'l', 13: 'm', 14: 'n', 15: 'o',
                   16: 'p', 17: 'q', 18: 'r', 19: 's', 20: 't',
                   21: 'u', 22: 'v', 23: 'w', 24: 'x', 25: 'y', 26: 'z'}
    return f'Заданному номеру соответствует буква "{my_alphabet.get(int(num))}"'


if __name__ == "__main__":
    print(alphabet())
